[
{"review_title": "Dont buy cheap quality  phone", "review_text": "Very dull display in sun light time . Outside  You can't view and read letters . Easily broke the touch screen. If I m using screen protector"},
{"review_title": "Good One", "review_text": "RAM 2GB IN 10990 IS NOT JUSTIFIED WHEN REALME 2 PRO IS COMING WITH BETTER HARDWARE WITHIN THE SAME PRICE"},
{"review_title": "Must buy for all", "review_text": "Best budget phone in market...battery life superb never went to finish up to 2 day of regular use..no  heating problems and there was no lagging issues at all face detection gives accuracy shocks in the night as it increases screen brightness to be high and detects you quickly and also the camera deserve a medal again nice combo pack in just 10000/-"},
{"review_title": "Awesome smartphone with cheapest range", "review_text": "Oppo you beauty... Camera quality is superb and battery backup is excellent."},
{"review_title": "Phone issues and Manufacturing quality.", "review_text": "It takes quite a long time to charge the phone. There is touch issue in the four corners of the phone. Camera quality is not great."},
{"review_title": "Super battery super sound", "review_text": "I have purchased this mobile phone a month ago,"},
{"review_title": "Very impressive", "review_text": "Very very good product I'm satisfied with this product,😊😊😊"},
{"review_title": "It's awesome as usual expected from Amazon!!!", "review_text": "Battery life is really awesome, sound quality top class, in looks no.1, feels really comfortable in hand, the notch thing is also really good camera as expected from oppo it's really really good and this phone comes with a portrait mode as well I just loved the color!!! Just go for it .... But let me tell you if you're looking for big storage go for the 32gb variant Because in this only 7GB is usable rest of the storage got eaten by the system OS 😅 but it's a good thing that it has 2 sim slots and both supports 4G and it comes with a dedicated sd card slot..."},
{"review_title": "Excellent low budget phone", "review_text": "This is my comprehensive review about the OPPO A3S, 2 GB ram, 16GB ROM"},
{"review_title": "Very nice phone", "review_text": "Battery backup is osam...... overall phone parfomance is fabulous.... I love my phone"},
{"review_title": "Mobile Switched off afer One Week of Purchase", "review_text": "I am ordered Oppo A3S Mobile on 8 December 2018, i am received mobile on 10 December 2018. i am startup installation completed on 10 December 2018, using from 10 December 2018 to 28th December on the day of 28th Night it is automatically switched off it is not swiched on any way to trying. so please give me the solution for this."},
{"review_title": "Good mobile on 10k range", "review_text": "Overall it's a good phone on 10k price with good battery backup, camera quality...it's been a week since i bought this phone and no issues found especially on heating problems and lagging issues after several app usage."},
{"review_title": "Good product", "review_text": "Nice"},
{"review_title": "Opportunity", "review_text": "A very fine mobile but a little expensive considering its features! But overall a very Good set."},
{"review_title": "Best when you buy with Amazon during offers.", "review_text": "The phone is very nice although a bit costly ( 12500) Market price . Picture quality is decent and battery life is superb."},
{"review_title": "Nice product but not the best.", "review_text": "This phone looks same as shown in the image but the video quality is poor and also I didn't get any sim tool ejector."},
{"review_title": "Camera quality", "review_text": "The camera quality is to bat..."},
{"review_title": "Paisa wasuul !!", "review_text": "Awesome phone !!"},
{"review_title": "Stylish and picture perfect", "review_text": "Nice phone, gloosy back looks cool and gives a premium phone feel.... Performance wise it's very good in it's segment...only drawback is no Fingerprint sensor. Also having little problem with the software notification settings but it's a software issue, maybe rectified in a next update. As for camera quality, oppo never disappoint in that"},
{"review_title": "Not as we expected...", "review_text": "There is no indication light for missed calls message alert and not also for battery is changing or not this is the biggest draw back of this model phone and it is where worst charging time for full charge it takes 4 hours..."},
{"review_title": "Best oppo", "review_text": "Nice mobile.oppo best low budget mobile. Camera superb,sound good.touch software nice.bettery excellent.big screen full view.i think best phone on this budget."},
{"review_title": "First of thanks Amazon", "review_text": "Very good phone I suggest to my friends this phone is very best for battery backup and camera clarity thank you Amazon"},
{"review_title": "Good phone with solid battery", "review_text": "Solid battery and crystal clear voice clarity."},
{"review_title": "Very nice product", "review_text": "Very good battery backup, good Camera, no heating problem,"},
{"review_title": "Average features but looks great", "review_text": "Screen resolution at this price is very bad.only 720p. No fingerprint sensor. Got this in great deal of exchange offer."},
{"review_title": "Ohk ohk display.", "review_text": "Good fone for starter."},
{"review_title": "Great", "review_text": "Love it"},
{"review_title": "Good phone", "review_text": "Nice"},
{"review_title": "Best mobile at this price", "review_text": "Got it during sale and worth every penny. Screen is so large and beautiful. Being used for more than 5 months with no problem whatsoever. 100 times better than xaomi."},
{"review_title": "Dont waste your money on this", "review_text": "I buy this befor 3 days ago nd it start hanging nd the pucture quality us vry bad"},
{"review_title": "The product is worth.", "review_text": "I bought this for my mom and she is really very happy with the product"},
{"review_title": "Very good product below 10k tag line...", "review_text": "Very good product below 10k tag line..."},
{"review_title": "Good", "review_text": "V good"},
{"review_title": "Fantastic product.", "review_text": "Nice phone. Notch display rocks."},
{"review_title": "Battery backup, Display, Sound, Speed Very good.No heating but charging time too long.", "review_text": "Super Phone,Battery backup, Display, Sound, Speed Very good but charging time too long."},
{"review_title": "Dead", "review_text": "Suddenly phone is dead,"},
{"review_title": "Awesome phone with grt specs", "review_text": "The best phone at this price...I first bought one for my wife in red colour I liked it so much that I bought for myself as well in purple. The camera quality is so good that my friends with iPhone 10 are liking the pictures of Oppo A3s"},
{"review_title": "Ok not nice", "review_text": "Oppo a3s camera is not good... But battery backup awesome... I m happy for battery backup and sound quality... 😊"},
{"review_title": "Nice but should have been a bit better", "review_text": "Screen resolution should have been a bit better by applying 3D viewing in this phone with full HD amoled display. But overall a good smartphone at this price. Also price should have been a bit low somewhat around 8000 approximately."},
{"review_title": "Good", "review_text": "Its good."},
{"review_title": "It worths its price", "review_text": "The phone is really good. Good battery life and I recommend it to everyone."},
{"review_title": "Storage space not given as per addj 16 gb", "review_text": "I have purchased oppo A3s &found 8.5gb internal storage instead of 16 gb. Very disappointed to see this fault. Amazon should not include in sell."},
{"review_title": "Nice one", "review_text": "Brought for my wife. Good one. Decent camera. I liked the build and it comes with a transparent back case and covered tampered glass / screen guard. Audio i s nice. Overall good. I liked he build mostly.."},
{"review_title": "part missing", "review_text": "overall product is very good but there is handset not available in the box. its disappointing."},
{"review_title": "Good", "review_text": "Picture quality, sound quality and battery life is too good.."},
{"review_title": "Love battery, but too basic camera quality.", "review_text": "Better than ok product. Love battery for which i baught but camera functions not developed."},
{"review_title": "Super", "review_text": "Front camera is not that much but ok. Battery life is good"},
{"review_title": "Worth for money... Awesome Phone", "review_text": "Very Nice phone in this budget. Amazing battery life and back color is awesome..just loved it. Very light weight , good camera, sound quality can be improved but otherwise it's good"},
{"review_title": "Good", "review_text": "Excellent design"},
{"review_title": "Good !!!!!", "review_text": "I got the product few days before. It is working really well and the picture quality is awesome. Battery backup is fine. It was delivered only after two days of booking. I am really satisfied."},
{"review_title": "Go get it..", "review_text": "Worth the deal by amazon. Good value for money. Super performance"},
{"review_title": "Problem", "review_text": "Even the though product is rather nice, the item Enlisted in the list of things we were to get with the phone was missing. The list clearly says a headset but it has been missing from the box."},
{"review_title": "Good", "review_text": "Good"},
{"review_title": "Dumb user", "review_text": "Bought by a dumb user , so only can operate simple functions"},
{"review_title": "Amazon agents need to change", "review_text": "The product is not as good as i expected..."},
{"review_title": "Great product in this price range", "review_text": "Great product in this price range"},
{"review_title": "Pathetic service by Amazon", "review_text": "Sim is not getting detected . Such a defective product sent by Amazon. When I'm asking for refunf people are saying they can only do replacement. Pathetic service by Amazon"},
{"review_title": "Overall 3.5", "review_text": "Its battery life is weak it's work normally for one Day not for two days and basically the price is too much without finger print sensor"},
{"review_title": "Processing too bad", "review_text": "Not good,but ok,"},
{"review_title": "Medium mob phones", "review_text": "Battery consumption is very high.. 21gb int available memory is provided only.. hangs too much"},
{"review_title": "Faulty display", "review_text": "Product received has defect in Display, even when keeping it at Full brightness in the dark, the display is not even at half."},
{"review_title": "Good one", "review_text": "Worth for money"},
{"review_title": "Fien product", "review_text": "Fine product"},
{"review_title": "Nice Phone", "review_text": "I used it and liked it... Nice phone. I was Samsung fan, first time I am using any Oppo mobile and now I am satisfied with it. Amazon and Oppo thanks to both of you."},
{"review_title": "Oppo is my opinion", "review_text": "I like most sound and picture quality battery yet to check because it's new phone."},
{"review_title": "Not worth it!!", "review_text": "U can get this device in different name in 7k. Why waste extra 4k just for name ."},
{"review_title": "Totally worthless!", "review_text": "No dual whatsapp, noisy cameras, display is not crisp either."},
{"review_title": "One of the very good products in this price range", "review_text": "Picture quality is good in day light, just ok for night capture. Sound quality is 7/10. Battery life is pretty good for normal usage and can last for 1.5 days"},
{"review_title": "Good", "review_text": "Good"},
{"review_title": "Best for the price.", "review_text": "Best for the price. Feeling this after 15 days of usage. Face unlock works awesome in almost light situations. Battery standby and overall performance is very good"}
]